{
    "colorObject":{		
        "colorName":"red",
        "description":"Red is the color at the end of the spectrum of visible light next to orange and opposite violet. Red color has a predominant light wavelength of roughly 620–740 nanometres. Red is one of the additive primary colors of visible light, along with green and blue, which in Red Green Blue (RGB) color systems are combined to create all the colors on a computer monitor or television screen. Red is also one of the subtractive primary colors, along with yellow and blue, of the RYB color space and traditional color wheel used by painters and artists. Reds can vary in shade from very light pink to very dark maroon or burgundy; and in hue from the bright orange-red scarlet or vermilion to the bluish-red crimson. Red was widely used in prehistoric cave art, made with red hematite or iron oxide, or red ochre. Early civilizations in China, the Middle East and Europe made red dyes from the madder plant or from a tiny insect called Kermes vermilio. Civilizations in the Americas made brilliant reds from another scale insect, the cochineal; ancient Chinese artists during the Han Dynasty used dye from the madder plant to color silk and pigments from lead oxide to color pottery. In ancient Rome red symbolized blood and courage; Roman soldiers wore red tunics, and generals wore a scarlet cloak, and had their bodies painted completely in red during ceremonial triumphs. It also sometimes represented sin; the Book of Revelation described the ‘’scarlet whore of Babylon.” In the Middle Ages, red was the color of majesty; it was the color of the banners of the Byzantine Empire, and the Emperor Charlemagne painted his palace red and wore red shoes as symbol of his authority. In Christianity it represented the blood of Christ and the Christian martyrs; in 1295 it became the color worn by Cardinals of the Roman Catholic Church. Merchants and ordinary people wore clothing dyed with madder at celebrations. Nobles and merchants wore the more intense red made with Kermes. In the 16th century, Spanish merchants began to import cochineal into Europe, which made an even more brilliant red; it became the fashion color of the aristocracy."
    }
}
